cask_args appdir: '/Applications'
tap 'homebrew/cask'
tap 'caskroom/versions'

# version control
brew 'git'

# editors
# cask 'intellij-idea-ce'
# cask 'sublime-text'
cask 'visual-studio-code'

# environment
cask 'iterm2'
brew 'zsh'

# languages
brew 'ruby'
# brew 'clojure'
brew 'elixir'
brew 'go'
brew 'erlang'
brew 'python'
# cask 'java'
# brew 'rabbitmq'

# language management/tools
# brew 'rbenv'
brew 'ruby-build'
brew 'nodenv'
brew 'asdf'

# databases
brew 'postgresql'
brew 'sqlite'

# productivity
cask 'alfred'
cask 'spectacle'
cask 'notion'

# apps
cask 'caffeine'
cask 'postico'
cask '1password'
cask 'google-chrome' 
cask 'firefox'
cask 'skitch'
cask 'postman'
cask 'slack'
cask 'microsoft-teams'
